# Terraform plan for staging
  
  ```
  Plan: 3 to add, 0 to change, 1 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks: Refreshing state... [id=projects/stg-piny940/secrets/home-kubernetes-cluster-jwks]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=stg-piny940/iamcredentials.googleapis.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]
module.clubroom.google_project_iam_member.clubroom_k8s_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Reading...
module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/terraform-github-actions]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=stg-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=stg-piny940/roles/owner/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:staging]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Read complete after 0s [id=projects/645068243364/secrets/home-kubernetes-cluster-jwks/versions/1]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.clubroom.google_project_iam_member.clubroom_k8s_storage_object_user will be destroyed
  # (because google_project_iam_member.clubroom_k8s_storage_object_user is not in configuration)
  - resource "google_project_iam_member" "clubroom_k8s_storage_object_user" {
      - etag    = "BwYjFQgBjDU=" -> null
      - id      = "stg-piny940/roles/storage.objectUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom" -> null
      - member  = "principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom" -> null
      - project = "stg-piny940" -> null
      - role    = "roles/storage.objectUser" -> null
    }

  # module.clubroom.google_project_iam_member.clubroom_storage_object_user will be created
  + resource "google_project_iam_member" "clubroom_storage_object_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "stg-piny940"
      + role    = "roles/storage.objectUser"
    }

  # module.clubroom.google_service_account.clubroom will be created
  + resource "google_service_account" "clubroom" {
      + account_id                   = "clubroom"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "Clubroom"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "stg-piny940"
      + unique_id                    = (known after apply)
    }

  # module.clubroom.google_service_account_iam_member.terraform_github_actions_workload_identity_user will be created
  + resource "google_service_account_iam_member" "terraform_github_actions_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
Please apply the changes to the staging environment using the [Terraform apply workflow](https://github.com/piny940/infra/actions/workflows/tf-apply.yaml)
